In [1]:
 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

In [6]:
df = pd.read_csv("C:/Users/User/Desktop/Python/train.csv")

,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.25,S,0.1
0,11,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1
1,13,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,1
2,11,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1
3,13,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,0
4,13,"Moran, Mr. James",male,37.0,0,0,8.4583,Q,0

In [10]:
# dd.drop("7",axis=1,inplace=True)
# dd.to_csv("train1.csv",index=False)

In [5]:
# new_cols = ["Ticket","PassengerId","Pclass",	"Sex",	"Age",	"SibSp",	"Parch",	"Fare",	"Cabin",	"Embarked","Survived"]
# # df=df[new_cols]
# #or
# df=df.reindex(columns=new_cols)

In [4]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [5]:
def impute(cols):
    Age=cols[0] 
    Pclass=cols[1]
    if pd.isnull(Age):

        if Pclass == 1:
            return df[df['Pclass']==1]['Age'].median()

        elif Pclass == 2:
            return df[df['Pclass']==1]['Age'].median()
        else:
            return df[df['Pclass']==1]['Age'].median()

    else:
        return Age

In [6]:
df['Age']=df[['Age','Pclass']].apply(impute,axis=1)

In [7]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
df.drop(['Cabin','PassengerId','Ticket'],axis=1,inplace=True)
df=df.dropna()
print(df.isnull().sum())

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [ ]:
len(df)

889

In [ ]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [9]:
new_cols = [ 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked','Survived']
# df=df[new_cols]
#or
df=df.reindex(columns=new_cols)
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Survived
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,0
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,1
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,1
4,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,0

In [ ]:
df2=df.copy()
df2.drop(['Name','Fare'],axis=1,inplace=True)
df2.copy()

     Pclass     Sex   Age  SibSp  Parch Embarked  Survived
0         3    male  22.0      1      0        S         0
1         1  female  38.0      1      0        C         1
2         3  female  26.0      0      0        S         1
3         1  female  35.0      1      0        S         1
4         3    male  35.0      0      0        S         0
..      ...     ...   ...    ...    ...      ...       ...
886       2    male  27.0      0      0        S         0
887       1  female  19.0      0      0        S         1
888       3  female  37.0      1      2        S         0
889       1    male  26.0      0      0        C         1
890       3    male  32.0      0      0        Q         0

[889 rows x 7 columns]

In [ ]:
df2.drop('Survived',axis=1,inplace=True)

NameError: name 'df2' is not defined

In [117]:

df.to_csv("train.csv",index=False)

In [85]:
df.drop(['Sex','Embarked','Name','Ticket'],axis=1,inplace=True)

In [86]:
df=pd.concat([df,embark,sex],axis=1)

In [87]:
df.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare  Q  S  male
0            1         0       3  22.0      1      0   7.2500  0  1     1
1            2         1       1  38.0      1      0  71.2833  0  0     0
2            3         1       3  26.0      0      0   7.9250  0  1     0
3            4         1       1  35.0      1      0  53.1000  0  1     0
4            5         0       3  35.0      0      0   8.0500  0  1     1

In [91]:
df=df.drop('PassengerId',axis=1)

   Survived  Pclass   Age  SibSp  Parch     Fare  Q  S  male
0         0       3  22.0      1      0   7.2500  0  1     1
1         1       1  38.0      1      0  71.2833  0  0     0
2         1       3  26.0      0      0   7.9250  0  1     0
3         1       1  35.0      1      0  53.1000  0  1     0
4         0       3  35.0      0      0   8.0500  0  1     1

In [93]:
new_cols = [	"Pclass",	"Age",	"SibSp",	"Parch",	"Fare",	"Q",	"S",	"male","Survived"]
# df=df[new_cols]
#or
df=df.reindex(columns=new_cols)

     Pclass   Age  SibSp  Parch     Fare  Q  S  male  Survived
0         3  22.0      1      0   7.2500  0  1     1         0
1         1  38.0      1      0  71.2833  0  0     0         1
2         3  26.0      0      0   7.9250  0  1     0         1
3         1  35.0      1      0  53.1000  0  1     0         1
4         3  35.0      0      0   8.0500  0  1     1         0
..      ...   ...    ...    ...      ... .. ..   ...       ...
886       2  27.0      0      0  13.0000  0  1     1         0
887       1  19.0      0      0  30.0000  0  1     0         1
888       3  37.0      1      2  23.4500  0  1     0         0
889       1  26.0      0      0  30.0000  0  0     1         1
890       3  32.0      0      0   7.7500  1  0     1         0

[889 rows x 9 columns]

In [94]:
df.head()

   Pclass   Age  SibSp  Parch     Fare  Q  S  male  Survived
0       3  22.0      1      0   7.2500  0  1     1         0
1       1  38.0      1      0  71.2833  0  0     0         1
2       3  26.0      0      0   7.9250  0  1     0         1
3       1  35.0      1      0  53.1000  0  1     0         1
4       3  35.0      0      0   8.0500  0  1     1         0

In [96]:
df.to_csv("titanic_dataset.csv",index=False)

In [97]:
t=pd.DataFrame(['1','2','3','4','5'])

In [100]:
t.to_csv("t.csv",index=False)